; domain
(define (domain zeno-travel)
(:requirements :typing)
(:types locatable city flevel - object
        aircraft person - locatable)
(:predicates (at ?x - locatable ?c - city)
             (in ?p - person ?a - aircraft)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 ?l2 - flevel))


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)))

(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)

 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 - flevel)
 
 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l2)))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city ?l1 ?l2 ?l3 - flevel)

 :precondition (and (at ?a ?c1)
                 (fuel-level ?a ?l1)
		 (next ?l2 ?l1)
		 (next ?l3 ?l2)
		)
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (not (fuel-level ?a ?l1))
              (fuel-level ?a ?l3)
	)
) 

(:action refuel
 :parameters (?a - aircraft ?c - city ?l - flevel ?l1 - flevel)

 :precondition (and (fuel-level ?a ?l)
                 (next ?l ?l1)
                 (at ?a ?c))
 :effect (and (fuel-level ?a ?l1) (not (fuel-level ?a ?l))))


)

; problem
(define (problem ZTRAVEL-5-15)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	city11 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city0)
	(fuel-level plane1 fl0)
	(at plane2 city3)
	(fuel-level plane2 fl4)
	(at plane3 city2)
	(fuel-level plane3 fl1)
	(at plane4 city9)
	(fuel-level plane4 fl1)
	(at plane5 city5)
	(fuel-level plane5 fl1)
	(at person1 city8)
	(at person2 city10)
	(at person3 city7)
	(at person4 city5)
	(at person5 city1)
	(at person6 city10)
	(at person7 city11)
	(at person8 city8)
	(at person9 city9)
	(at person10 city11)
	(at person11 city4)
	(at person12 city5)
	(at person13 city8)
	(at person14 city4)
	(at person15 city1)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at person1 city1)
	(at person2 city4)
	(at person3 city7)
	(at person4 city6)
	(at person5 city8)
	(at person6 city11)
	(at person7 city2)
	(at person8 city11)
	(at person10 city9)
	(at person11 city6)
	(at person12 city4)
	(at person13 city11)
	(at person14 city4)
	(at person15 city6)
	))
(:metric minimize (total-time))

)

; plan
1. (zoom plane2 city3 city1 fl4 fl3 fl2)
   deleted: (at plane2 city3) (fuel-level plane2 fl4)
   added: (at plane2 city1) (fuel-level plane2 fl2)
   goals met: 2 of 14
2. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 2 of 14
3. (fly plane1 city0 city5 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city5) (fuel-level plane1 fl0)
   goals met: 2 of 14
4. (board person5 plane2 city1)
   deleted: (at person5 city1)
   added: (in person5 plane2)
   goals met: 2 of 14
5. (fly plane2 city1 city8 fl2 fl1)
   deleted: (at plane2 city1) (fuel-level plane2 fl2)
   added: (at plane2 city8) (fuel-level plane2 fl1)
   goals met: 2 of 14
6. (fly plane4 city9 city8 fl1 fl0)
   deleted: (at plane4 city9) (fuel-level plane4 fl1)
   added: (at plane4 city8) (fuel-level plane4 fl0)
   goals met: 2 of 14
7. (board person8 plane4 city8)
   deleted: (at person8 city8)
   added: (in person8 plane4)
   goals met: 2 of 14
8. (board person1 plane4 city8)
   deleted: (at person1 city8)
   added: (in person1 plane4)
   goals met: 2 of 14
9. (board person12 plane1 city5)
   deleted: (at person12 city5)
   added: (in person12 plane1)
   goals met: 2 of 14
10. (refuel plane1 city5 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 2 of 14
11. (debark person5 plane2 city8)
   deleted: (in person5 plane2)
   added: (at person5 city8)
   goals met: 3 of 14
12. (fly plane1 city5 city4 fl1 fl0)
   deleted: (at plane1 city5) (fuel-level plane1 fl1)
   added: (at plane1 city4) (fuel-level plane1 fl0)
   goals met: 3 of 14
13. (refuel plane4 city8 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 3 of 14
14. (fly plane4 city8 city1 fl1 fl0)
   deleted: (at plane4 city8) (fuel-level plane4 fl1)
   added: (at plane4 city1) (fuel-level plane4 fl0)
   goals met: 3 of 14
15. (debark person1 plane4 city1)
   deleted: (in person1 plane4)
   added: (at person1 city1)
   goals met: 4 of 14
16. (board person15 plane4 city1)
   deleted: (at person15 city1)
   added: (in person15 plane4)
   goals met: 4 of 14
17. (fly plane3 city2 city11 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl1)
   added: (at plane3 city11) (fuel-level plane3 fl0)
   goals met: 4 of 14
18. (board person7 plane3 city11)
   deleted: (at person7 city11)
   added: (in person7 plane3)
   goals met: 4 of 14
19. (debark person12 plane1 city4)
   deleted: (in person12 plane1)
   added: (at person12 city4)
   goals met: 5 of 14
20. (board person13 plane2 city8)
   deleted: (at person13 city8)
   added: (in person13 plane2)
   goals met: 5 of 14
21. (fly plane2 city8 city11 fl1 fl0)
   deleted: (at plane2 city8) (fuel-level plane2 fl1)
   added: (at plane2 city11) (fuel-level plane2 fl0)
   goals met: 5 of 14
22. (debark person13 plane2 city11)
   deleted: (in person13 plane2)
   added: (at person13 city11)
   goals met: 6 of 14
23. (refuel plane2 city11 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 6 of 14
24. (fly plane2 city11 city8 fl1 fl0)
   deleted: (at plane2 city11) (fuel-level plane2 fl1)
   added: (at plane2 city8) (fuel-level plane2 fl0)
   goals met: 6 of 14
25. (refuel plane2 city8 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 6 of 14
26. (fly plane2 city8 city10 fl1 fl0)
   deleted: (at plane2 city8) (fuel-level plane2 fl1)
   added: (at plane2 city10) (fuel-level plane2 fl0)
   goals met: 6 of 14
27. (board person6 plane2 city10)
   deleted: (at person6 city10)
   added: (in person6 plane2)
   goals met: 6 of 14
28. (refuel plane4 city1 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 6 of 14
29. (fly plane4 city1 city6 fl1 fl0)
   deleted: (at plane4 city1) (fuel-level plane4 fl1)
   added: (at plane4 city6) (fuel-level plane4 fl0)
   goals met: 6 of 14
30. (debark person15 plane4 city6)
   deleted: (in person15 plane4)
   added: (at person15 city6)
   goals met: 7 of 14
31. (refuel plane3 city11 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 14
32. (fly plane3 city11 city2 fl1 fl0)
   deleted: (at plane3 city11) (fuel-level plane3 fl1)
   added: (at plane3 city2) (fuel-level plane3 fl0)
   goals met: 7 of 14
33. (debark person7 plane3 city2)
   deleted: (in person7 plane3)
   added: (at person7 city2)
   goals met: 8 of 14
34. (refuel plane2 city10 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 8 of 14
35. (board person4 plane5 city5)
   deleted: (at person4 city5)
   added: (in person4 plane5)
   goals met: 8 of 14
36. (fly plane5 city5 city10 fl1 fl0)
   deleted: (at plane5 city5) (fuel-level plane5 fl1)
   added: (at plane5 city10) (fuel-level plane5 fl0)
   goals met: 8 of 14
37. (board person2 plane5 city10)
   deleted: (at person2 city10)
   added: (in person2 plane5)
   goals met: 8 of 14
38. (refuel plane5 city10 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 8 of 14
39. (fly plane5 city10 city4 fl1 fl0)
   deleted: (at plane5 city10) (fuel-level plane5 fl1)
   added: (at plane5 city4) (fuel-level plane5 fl0)
   goals met: 8 of 14
40. (debark person2 plane5 city4)
   deleted: (in person2 plane5)
   added: (at person2 city4)
   goals met: 9 of 14
41. (board person11 plane5 city4)
   deleted: (at person11 city4)
   added: (in person11 plane5)
   goals met: 9 of 14
42. (refuel plane5 city4 fl0 fl1)
   deleted: (fuel-level plane5 fl0)
   added: (fuel-level plane5 fl1)
   goals met: 9 of 14
43. (fly plane5 city4 city6 fl1 fl0)
   deleted: (at plane5 city4) (fuel-level plane5 fl1)
   added: (at plane5 city6) (fuel-level plane5 fl0)
   goals met: 9 of 14
44. (debark person11 plane5 city6)
   deleted: (in person11 plane5)
   added: (at person11 city6)
   goals met: 10 of 14
45. (fly plane2 city10 city11 fl1 fl0)
   deleted: (at plane2 city10) (fuel-level plane2 fl1)
   added: (at plane2 city11) (fuel-level plane2 fl0)
   goals met: 10 of 14
46. (debark person6 plane2 city11)
   deleted: (in person6 plane2)
   added: (at person6 city11)
   goals met: 11 of 14
47. (refuel plane4 city6 fl0 fl1)
   deleted: (fuel-level plane4 fl0)
   added: (fuel-level plane4 fl1)
   goals met: 11 of 14
48. (fly plane4 city6 city11 fl1 fl0)
   deleted: (at plane4 city6) (fuel-level plane4 fl1)
   added: (at plane4 city11) (fuel-level plane4 fl0)
   goals met: 11 of 14
49. (debark person8 plane4 city11)
   deleted: (in person8 plane4)
   added: (at person8 city11)
   goals met: 12 of 14
50. (board person10 plane2 city11)
   deleted: (at person10 city11)
   added: (in person10 plane2)
   goals met: 12 of 14
51. (refuel plane2 city11 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 12 of 14
52. (fly plane2 city11 city9 fl1 fl0)
   deleted: (at plane2 city11) (fuel-level plane2 fl1)
   added: (at plane2 city9) (fuel-level plane2 fl0)
   goals met: 12 of 14
53. (debark person10 plane2 city9)
   deleted: (in person10 plane2)
   added: (at person10 city9)
   goals met: 13 of 14
54. (debark person4 plane5 city6)
   deleted: (in person4 plane5)
   added: (at person4 city6)
   goals met: 14 of 14
